Конфигурация/Catalogs/ВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ВариантыОтчетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Общий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредопределенныйВариант</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/SettingsStorages/ХранилищеВариантовИНастроекОтчетов/Forms/ФормаЗагрузки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Ключ		 = Параметры.КлючОбъекта;
	ЭтаФорма.Организация = ?(ЗначениеЗаполнено(Параметры.Организация), Параметры.Организация, ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация"));
	ЭтаФорма.Автор		 = РаботаСПользователями.ТекущийПользователь();
	
	ЭтаФорма.Список.Загрузить(Справочники.ВариантыОтчетов.ПолучитьТаблицуВариантовОтчета(ЭтаФорма.Ключ, ЭтаФорма.Организация, ЭтаФорма.Автор));
	
	Если ТипЗнч(Параметры.КлючТекущихНастроек) = Тип("УникальныйИдентификатор") Тогда
	
		ВариантОтчета = Справочники.ВариантыОтчетов.ПолучитьСсылку(Параметры.КлючТекущихНастроек);
		
		НайденныеСтрокии = ЭтаФорма.Список.НайтиСтроки(Новый Структура("Ссылка", ВариантОтчета));
		
		Если НайденныеСтрокии.Количество() = 1 Тогда
			Элементы.Список.ТекущаяСтрока = НайденныеСтрокии[0].ПолучитьИдентификатор();
		КонецЕсли; 	
	
	КонецЕсли;
	
	ЭтаФорма.ПолныеПрава = РольДоступна("ПолныеПрава");
	Элементы.НастройкиДругихПользователей.Видимость = ЭтаФорма.ПолныеПрава;
	
	Если НРег(Лев(ЭтаФорма.Ключ, 9)) = "обработка" Или НРег(Лев(ЭтаФорма.Ключ, 16)) = "внешняяобработка" Тогда
		ЭтаФорма.Заголовок = "Выбор настроек";
	ИначеЕсли СтрНайти(ЭтаФорма.Ключ, "/") = 0 Тогда
		ЭтаФорма.Заголовок = "Выбор варианта отчета";
	Иначе
		ЭтаФорма.Заголовок = "Выбор настройки отчета";
	КонецЕсли; 
		
КонецПроцедуры
	
#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Закрыть(Новый ВыборНастроек(Элемент.ТекущиеДанные.Ссылка.УникальныйИдентификатор()));
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если Не ТекСтрока = Неопределено Тогда
		Если ЭтаФорма.ПолныеПрава Или ЭтаФорма.Автор = ТекСтрока.Автор Тогда
			
			Параметрыформы = Новый Структура("Ключ", ТекСтрока.Ссылка);
			ОткрытьФормуМодально("Справочник.ВариантыОтчетов.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);
			Обновить(Неопределено);
			
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если Не ТекСтрока = Неопределено Тогда
		Если (ЭтаФорма.ПолныеПрава Или ЭтаФорма.Автор = ТекСтрока.Автор) Тогда
			
			Если ТекСтрока.Картинка = 3 Тогда
			
				ТекстВопроса = "Снять с """ + ТекСтрока.Ссылка + """ пометку на удаление?";
				
			Иначе
				
				ТекстВопроса = "Пометить """ + ТекСтрока.Ссылка + """ на удаление?";
			
			КонецЕсли; 
			
			Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			
				УстановитьПометкуУдаления(ТекСтрока.Ссылка);
				Обновить(Неопределено);
				
			КонецЕсли;
			
		КонецЕсли; 
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура НастройкиДругихПользователейПриИзменении(Элемент)
	Обновить(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПомеченныеНаУдалениеПриИзменении(Элемент)
	Обновить(Неопределено);
КонецПроцедуры

#КонецОбласти 

#Область КомандыФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если Не ТекСтрока = Неопределено Тогда
	
		Закрыть(Новый ВыборНастроек(ТекСтрока.Ссылка.УникальныйИдентификатор()));
	
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	КлючТекущейСтрокиСписок = РаботаСФормамиКлиент.ПолучитьКлючТекущейСтроки(Элементы.Список, "Ссылка");
	ОбновитьСписок();
	РаботаСФормамиКлиент.ВосстановитьТекущуюСтрокуПоКлючу(ЭтаФорма.Список, Элементы.Список, "Ссылка", КлючТекущейСтрокиСписок);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписок()
	
	Если НастройкиДругихПользователей Тогда
	    ТекАвтор = Неопределено;
	Иначе
		ТекАвтор = Автор;
	КонецЕсли; 	
	
	ЭтаФорма.Список.Загрузить(Справочники.ВариантыОтчетов.ПолучитьТаблицуВариантовОтчета(ЭтаФорма.Ключ, ЭтаФорма.Организация, ТекАвтор, Не ПомеченныеНаУдаление));
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура УстановитьПометкуУдаления(Ссылка)

	Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Не Ссылка.ПометкаУдаления);

КонецПроцедуры

#КонецОбласти
